Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda (Lambda)                 [(None, None, 257),  0           input_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_add (TensorFlowOpLa [(None, None, 257)]  0           lambda[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_Log (TensorFlowOpLa [(None, None, 257)]  0           tf_op_layer_add[0][0]            
__________________________________________________________________________________________________
instant_layer_normalization (In (None, None, 257)    514         tf_op_layer_Log[0][0]            
__________________________________________________________________________________________________
lstm (LSTM)                     (None, None, 156)    258336      instant_layer_normalization[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, None, 156)    0           lstm[0][0]                       
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, None, 156)    195312      dropout[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, None, 257)    40349       lstm_1[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, 257)    0           dense[0][0]                      
__________________________________________________________________________________________________
multiply (Multiply)             (None, None, 257)    0           lambda[0][0]                     
                                                                 activation[0][0]                 
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, None, 156)    258336      multiply[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 156)    0           lstm_2[0][0]                     
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, None, 156)    195312      dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, None, 257)    40349       lstm_3[0][0]                     
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, 257)    0           dense_1[0][0]                    
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, None, 257)    0           lambda[0][0]                     
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, None, 512)    0           multiply_1[0][0]                 
                                                                 lambda[0][1]                     
__________________________________________________________________________________________________
tf_op_layer_mul (TensorFlowOpLa [(None, None, 512)]  0           lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, None)         0           tf_op_layer_mul[0][0]            
==================================================================================================
Total params: 988,508
Trainable params: 988,508
Non-trainable params: 0
__________________________________________________________________________________________________
